#include <stdio.h>
#include <sys/ioctl.h>
#include <unistd.h>

int main() {                       
    struct winsize info;
    ioctl(STDIN_FILENO, TIOCGWINSZ, &info);
    printf("------------------------------------------\n");
    printf("         \033[33;1mrows: %d\tcols: %d\033[0m\n", info.ws_row, info.ws_col);
    printf("   !以下的控制字符并不是所有终端都支持!\n");
    printf("------------------------------------------\n");
    printf("\\033[\033[36mx\033[0m;\033[36my\033[0mH      将光标移至第 \033[36mx\033[0m 行，第 \033[36my\033[0m 列\n");
    printf("\\033[\033[36mn\033[0mA        光标上移 \033[36mn\033[0m 行\n");
    printf("\\033[\033[36mn\033[0mB        光标下移 \033[36mn\033[0m 行\n");
    printf("\\033[\033[36mn\033[0mC        光标向右 \033[36mn\033[0m 列\n");
    printf("\\033[\033[36mn\033[0mD        光标向左 \033[36mn\033[0m 列\n");
    printf("------------------------------------------\n");
    printf("\\033[6n        报告光标位置\n");
    printf("\\033[s         保存目前的光标位置\n");
    printf("\\033[u         取出保存的光标位置\n");
    printf("\\033[?25l      隐藏光标\n");
    printf("\\033[?25h      显示光标\n");
    printf("\\033[2J        清空屏幕\n");
    printf("\\033[K         清除光标位置到行尾的字符\n");
    printf("------------------------------------------\n");
    printf("\\033[1I        \033[1I宋体\033[0I\n");
    printf("\\033[2I        \033[2I黑体\033[0I\n");
    printf("\\033[3I        \033[3I楷体\033[0I\n");
    printf("\\033[0I        恢复到正常字体\n");
    printf("------------------------------------------\n");
    printf("\\033[1m        \033[1m加粗\033[0m\n");
    printf("\\033[2m        \033[2m模糊\033[0m\n");
    printf("\\033[3m        \033[3m倾斜\033[0m\n");
    printf("\\033[4m        \033[4m下划线\033[0m\n");
    printf("\\033[5m        \033[5m闪烁\033[0m\n");
    printf("\\033[6m        \033[6m闪烁（更快的）\033[0m\n");
    printf("\\033[7m        \033[7m反相\033[0m\n");
    printf("\\033[8m        不可见\n");
    printf("\\033[0m        所有属性恢复默认\n");
    printf("------------------------------------------\n");
    printf("  文字        背景      颜色\n");
    printf("\033[47m\033[30m\\033[30m\033[0m    \033[40m\\033[40m\033[0m    \033[47m\033[30m黑色\033[0m\n");
    printf("\033[31m\\033[31m\033[0m    \033[41m\\033[41m\033[0m    \033[31m红色\033[0m\n");
    printf("\033[32m\\033[32m\033[0m    \033[42m\\033[42m\033[0m    \033[32m绿色\033[0m\n");
    printf("\033[33m\\033[33m\033[0m    \033[43m\\033[43m\033[0m    \033[33m黄色\033[0m\n");
    printf("\033[34m\\033[34m\033[0m    \033[44m\\033[44m\033[0m    \033[34m蓝色\033[0m\n");
    printf("\033[35m\\033[35m\033[0m    \033[45m\\033[45m\033[0m    \033[35m紫红色\033[0m\n");
    printf("\033[36m\\033[36m\033[0m    \033[46m\\033[46m\033[0m    \033[36m青蓝色\033[0m\n");
    printf("\033[37m\\033[37m\033[0m    \033[30m\033[47m\\033[47m\033[0m    \033[37m白色\033[0m\n");
    printf("\n加上1可以高亮显示颜色，如\033[32;1m\\033[32;1m\033[0m\033[0m\n");
    printf("------------------------------------------\n");
    printf("\\033[38;2;\033[31;1mr\033[0m;\033[32;1mg\033[0m;\033[34;1mb\033[0mm      设置前景 \033[31;1mr\033[0m \033[32;1mg\033[0m \033[34;1mb\033[0m 颜色\n");
    printf("\\033[48;2;\033[31;1mr\033[0m;\033[32;1mg\033[0m;\033[34;1mb\033[0mm      设置背景 \033[37;41;1mr\033[0m \033[37;42;1mg\033[0m \033[37;44;1mb\033[0m 颜色\n");
    printf("------------------------------------------\n");
    return 0;
}